slank/esp32-bt/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32s3"

# Route ESP_LOG console to UART0 (not USB-Serial-JTAG) so there is no
# conflict between the USB-Serial-JTAG peripheral and TinyUSB's USB-OTG
# controller — both share the same PHY on ESP32-S3.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# TinyUSB CDC
CONFIG_TINYUSB_CDC_ENABLED=y

# Bluetooth – controller only (no host stack), BLE only
CONFIG_BT_ENABLED=y
CONFIG_BT_CONTROLLER_ONLY=y

# Increase USB CDC buffers to handle large HCI packets
CONFIG_TINYUSB_CDC_RX_BUFSIZE=512
CONFIG_TINYUSB_CDC_TX_BUFSIZE=512
